In [29]:
import numpy as np
import pandas as pd

In [30]:
df = pd.read_csv('cardekho_imputated.csv')
df.head()

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

**EDA of data**

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15411 entries, 0 to 15410
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         15411 non-null  int64
 1   car_name           15411 non-null  object
 2   brand              15411 non-null  object
 3   model              15411 non-null  object
 4   vehicle_age        15411 non-null  int64
 5   km_driven          15411 non-null  int64
 6   seller_type        15411 non-null  object
 7   fuel_type          15411 non-null  object
 8   transmission_type  15411 non-null  object
 9   mileage            15411 non-null  float64
 10  engine             15411 non-null  int64
 11  max_power          15411 non-null  float64
 12  seats              15411 non-null  int64
 13  selling_price      15411 non-null  int64
dtypes: float64(2), int64(6), object(6)
memory usage: 1.6+ MB

In [32]:
df.isnull().sum()

Unnamed: 0           0
car_name             0
brand                0
model                0
vehicle_age          0
km_driven            0
seller_type          0
fuel_type            0
transmission_type    0
mileage              0
engine               0
max_power            0
seats                0
selling_price        0
dtype: int64

In [33]:
df.shape

(15411, 14)

In [34]:
df.drop(columns=['Unnamed: 0'],inplace=True)
df.head()

,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

**6 coloums needs to be Encoded to numerical**

In [35]:
df['seller_type'].value_counts()

seller_type
Dealer              9539
Individual          5699
Trustmark Dealer     173
Name: count, dtype: int64

In [36]:
df['fuel_type'].value_counts()

fuel_type
Petrol      7643
Diesel      7419
CNG          301
LPG           44
Electric       4
Name: count, dtype: int64

In [37]:
df['transmission_type'].value_counts()

transmission_type
Manual       12225
Automatic     3186
Name: count, dtype: int64

In [38]:
df['engine'].value_counts()

engine
1197    2436
1248    1668
998     1174
1498    1095
2179     669
        ...
1781       1
2997       1
1597       1
2596       1
4163       1
Name: count, Length: 110, dtype: int64

In [39]:
df['max_power'].value_counts()

max_power
74.00     791
88.50     589
81.80     544
98.60     424
67.04     390
         ...
221.30      1
75.10       1
349.50      1
170.63      1
177.01      1
Name: count, Length: 342, dtype: int64

In [40]:
df['seats'].value_counts()

seats
5    12910
7     1922
8      311
6      127
4       77
9       55
2        7
0        2
Name: count, dtype: int64

**We will do Label encoding for seller, fuel and transmission**

In [41]:
df['seller_type'] = df['seller_type'].map({'Individual': 0, 'Dealer': 1, 'Trustmark Dealer': 2})
df['fuel_type'] = df['fuel_type'].map({'Petrol': 0, 'Diesel': 1, 'Electric': 2, 'CNG': 3, 'LPG': 4})
df['transmission_type'] = df['transmission_type'].map({'Manual': 0, 'Automatic': 1})

In [42]:
df.head()

,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,Maruti Alto,Maruti,Alto,9,120000,0,0,0,19.70,796,46.30,5,120000
1,Hyundai Grand,Hyundai,Grand,5,20000,0,0,0,18.90,1197,82.00,5,550000
2,Hyundai i20,Hyundai,i20,11,60000,0,0,0,17.00,1197,80.00,5,215000
3,Maruti Alto,Maruti,Alto,9,37000,0,0,0,20.92,998,67.10,5,226000
4,Ford Ecosport,Ford,Ecosport,6,30000,1,1,0,22.77,1498,98.59,5,570000

**We will do target encoding for brand, model**

In [43]:
df['brand'] = df.groupby('brand')['selling_price'].transform('mean')

In [44]:
df['model'] = df.groupby('model')['selling_price'].transform('mean')

In [45]:
df.drop(columns=['car_name'],inplace=True)

In [46]:
df.head()

,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,487089.317909,245452.442159,9,120000,0,0,0,19.70,796,46.30,5,120000
1,576153.923541,474451.724138,5,20000,0,0,0,18.90,1197,82.00,5,550000
2,576153.923541,543603.752759,11,60000,0,0,0,17.00,1197,80.00,5,215000
3,487089.317909,245452.442159,9,37000,0,0,0,20.92,998,67.10,5,226000
4,645224.050633,706227.272727,6,30000,1,1,0,22.77,1498,98.59,5,570000

**All data are in different ranges, we need to standerdise it**

In [47]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
new_df=scaler.fit_transform(df)
df=pd.DataFrame(new_df,columns=df.columns)
df.head()

,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,-0.404837,-0.673371,0.983562,1.247335,-1.276609,-0.873495,-0.510503,-0.000276,-1.324259,-1.263352,-0.403022,-0.732548
1,-0.279589,-0.382160,-0.343933,-0.690016,-1.276609,-0.873495,-0.510503,-0.192071,-0.554718,-0.432571,-0.403022,-0.251618
2,-0.279589,-0.294222,1.647309,0.084924,-1.276609,-0.873495,-0.510503,-0.647583,-0.554718,-0.479113,-0.403022,-0.626296
3,-0.404837,-0.673371,0.983562,-0.360667,-1.276609,-0.873495,-0.510503,0.292211,-0.936610,-0.779312,-0.403022,-0.613993
4,-0.182458,-0.087419,-0.012060,-0.496281,0.713661,0.709086,-0.510503,0.735736,0.022918,-0.046502,-0.403022,-0.229249

**Linear Regression**

In [48]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_absolute_percentage_error

In [49]:
X = df.drop(columns=['selling_price'],axis=1)
y = df['selling_price']
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [50]:
model = LinearRegression()
model.fit(X_train,y_train)
y_pred = model.predict(X_test)

In [51]:
model.score(X_test,y_test)

0.7906725563053804

In [52]:
model.score(X_train,y_train)

0.8360354929909483

In [57]:
from sklearn.metrics import mean_squared_error, r2_score
mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)
print(f"Mean Squared Error: {mse}")
print(f"R-squared: {r2}")

Mean Squared Error: 0.19711683323461965
R-squared: 0.7906725563053804

In [53]:
(model.coef_, model.intercept_)

(array([ 0.10963324,  0.6855822 , -0.20706117, -0.0516102 ,  0.00441376,
         0.02015398,  0.03234513,  0.00353964, -0.01386365,  0.09243025,
         0.01502065]),
 np.float64(-0.001365813368601408))

In [54]:
mean_absolute_percentage_error(y_test,y_pred)

16.909516409287267

In [55]:
X_encoded = X.copy()

In [56]:
from statsmodels.stats.outliers_influence import variance_inflation_factor
import pandas as pd
import numpy as np

X_vif = X_encoded.copy()

vif_data = pd.DataFrame()
vif_data["feature"] = X_vif.columns
vif_data["VIF"] = [
    variance_inflation_factor(X_vif.values, i)
    for i in range(X_vif.shape[1])
]

vif_data.sort_values("VIF", ascending=False).head(10)

              feature       VIF
1               model  7.907817
8              engine  6.974006
9           max_power  6.928064
0               brand  5.821110
7             mileage  2.819015
10              seats  2.355499
5           fuel_type  1.677478
6   transmission_type  1.543434
2         vehicle_age  1.349927
3           km_driven  1.225892

As we can see, VIF is not high for any. So no need to drop any feature as none are multicollinear